-- 1. Вывести средний оклад (salary) всех сотрудников
select avg(salary) from doctors;

-- +--------------+
-- | avg(salary)  |
-- +--------------+
-- | 72767.671429 |
-- +--------------+
-- 1 row in set (0.0005 sec)

-- 2. Вывести среднюю премию для всех сотрудников, чей доход выше среднего (взять явное значение из результата предыдущего запроса)
select
  avg(premium)
from doctors
where salary > 72767.671429;

-- +--------------+
-- | avg(premium) |
-- +--------------+
-- | 21681.382353 |
-- +--------------+
-- 1 row in set (0.0004 sec)


-- 3. Вывести с сортировкой по возрастанию среднее количество дней в отпуске для каждого сотрудника — используйте функцию datediff()
select
  doctors_id, 
  avg(datediff(end_date, start_date)) as 'avg_vacation'
from vacations
group by doctors_id
order by `avg_vacation`;

-- +------------+--------------+
-- | doctors_id | avg_vacation |
-- +------------+--------------+
-- |         37 |      15.4444 |
-- |          1 |      16.1000 |
-- |         33 |      17.3000 |
-- |          3 |      18.3636 |
-- .............................
-- |         27 |      29.6667 |
-- |         11 |      30.0000 |
-- |         31 |      33.3636 |
-- |         50 |      34.7500 |
-- +------------+--------------+
-- 70 rows in set (0.0017 sec)

-- 4. Вывести для каждого сотрудника самый ранний год отпуска и самый поздний год отпуска с сортировкой по возрастанию разности между этими двумя значениями
select
  doctors_id, 
  min(year(start_date)) as 'min',
  max(year(start_date)) as 'max' 
from vacations
group by doctors_id
order by `max` - `min`;

-- +------------+------+------+
-- | doctors_id | min  | max  |
-- +------------+------+------+
-- |         34 | 2001 | 2007 |
-- |         57 | 2001 | 2010 |
-- |         27 | 2001 | 2013 |
-- |         70 | 2002 | 2014 |
-- ............................
-- |         68 | 2003 | 2024 |
-- |         29 | 2000 | 2021 |
-- |          6 | 2000 | 2023 |
-- |         58 | 2000 | 2023 |
-- +------------+------+------+
-- 70 rows in set (0.0015 sec)


--5. Вывести сумму пожертвований за всё время для каждого отделения с сортировкой по возрастанию номеров отделений
select
  departments_id, 
  sum(amount)
from donations
group by departments_id
order by departments_id;

-- +----------------+-------------+
-- | departments_id | sum(amount) |
-- +----------------+-------------+
-- |              1 |  3906387.00 |
-- |              2 | 14824812.00 |
-- |              3 |  5329716.00 |
-- |              4 | 17541590.00 |
-- |              5 | 18834643.00 |
-- |              6 |  8932248.00 |
-- |              7 |  3288830.00 |
-- +----------------+-------------+
-- 7 rows in set (0.0005 sec)

--6. Вывести сумму пожертвований за каждый год для каждого спонсора с сортировкой по возрастанию номеров спонсоров и годов
select
  sponsors_id, 
  year(date) as 'year',
  sum(amount)
from donations
group by sponsors_id, `year`
order by sponsors_id, `year`;

-- +-------------+------+-------------+
-- | sponsors_id | year | sum(amount) |
-- +-------------+------+-------------+
-- |           1 | 2008 |  2031320.00 |
-- |           2 | 2004 |   245080.00 |
-- |           2 | 2005 |  1629290.00 |
-- |           2 | 2007 |  1580363.00 |
-- |           2 | 2009 |  2531422.00 |
-- |           2 | 2016 |  1843308.00 |
-- ....................................
-- |          11 | 2021 |   582378.00 |
-- |          12 | 2002 |   772941.00 |
-- |          12 | 2006 |   277402.00 |
-- |          12 | 2012 |  1736411.00 |
-- |          12 | 2018 |   127413.00 |
-- |          12 | 2021 |  1870133.00 |
-- +-------------+------+-------------+
-- 62 rows in set (0.0010 sec)