from utils import important_message

def main() -> None:
    """ запрашивает у пользователя сообщение и выводит его с помощью функции important_message из другого модуля"""
    
    message = input('введите сообщение: ')
    print(f'\n{important_message(message)}\n')
    return None
    
#>>> main()
#введите сообщение: ЗАГОЛОВОК ПРОГРАММЫ

#====================================================================================#
#                                                                                    #
#                                ЗАГОЛОВОК ПРОГРАММЫ                                 #
#                                                                                    #
#====================================================================================#

#>>>  
#>>> text = 'Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы'
#>>> msg = important_message(text)
#>>> print(msg)
#====================================================================================#
#                                                                                    #
#     Обратите внимание на очень важное сообщение от команды разработчиков этой      #
#                               великолепной программы                               #
#                                                                                    #
#====================================================================================#
#>>>    