# ИСПРАВИТЬ: импорт модулей собственного проекта в общем случае предпочтительнее осуществлять с помощью инструкции import ...
from utils import important_message


def main() -> None:
    """Запрашивает у пользователя сообщение и выводит его с помощью функции important_message из другого модуля."""
    message = input('введите сообщение: ')
    print(f'\n{important_message(message)}\n')
    return None


# ИСПОЛЬЗОВАТЬ везде: PEP 8 рекомендует добавлять пробелы после символа # — в большинстве редакторов кода, включая Notepad++, это делает команда "Вкл./Выкл. комментарий"
# >>> main()
# введите сообщение: ЗАГОЛОВОК ПРОГРАММЫ

#====================================================================================#
#                                                                                    #
#                                ЗАГОЛОВОК ПРОГРАММЫ                                 #
#                                                                                    #
#====================================================================================#

# >>>
# >>> text = 'Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы'
# >>> msg = important_message(text)
# >>> print(msg)
#====================================================================================#
#                                                                                    #
#     Обратите внимание на очень важное сообщение от команды разработчиков этой      #
#                               великолепной программы                               #
#                                                                                    #
#====================================================================================#

# >>> text = слово слово слово слово слово слово слово слово слово слово слово слово слово слово слово
# >>> print(important_message(text))
#=============================================================================#
#                                                                             #
#слово слово слово слово слово слово слово слово слово слово слово слово слово#
#                                 слово слово                                 #
#                                                                             #
#=============================================================================#
# КОММЕНТАРИЙ: а должно быть:
#=============================================================================#
#                                                                             #
#  слово слово слово слово слово слово слово слово слово слово слово слово    #
#                              слово слово слово                              #
#                                                                             #
#=============================================================================#


# ИТОГ: хорошо, немного доработать — 3/4


# КОММЕНТАРИЙ: PEP 8 — сборник рекомендаций по стилистическому оформлению Python кода — их стоит использовать для большего удобства чтения своего и чужого кода: https://peps.python.org/pep-0008/
