from shutil import get_terminal_size 

def important_message(text: str) -> str:
    """Генерирует строку, в которой переданный текст будет обрамлён рамкой из символов '=' и '#'."""
    
    width = get_terminal_size().columns - 3

    out = f'#{"="*(width)}#\n#{" "*(width)}#\n'
    
    multiline, line_len, i = [[]], 0, 0
    for word in text.split():
        word_len = len(word)
        if line_len + word_len + len(multiline[i]) <= width:
            multiline[i] += [word]
            line_len += word_len
        else:
            multiline += [[word]]
            line_len = word_len
            i += 1

    for line in multiline:
        out += f'#{" ".join(line).center(width)}#\n'

    out += f'#{" "*(width)}#\n#{"="*(width)}#'
    return out
    
#>>> main()
#введите сообщение: ЗАГОЛОВОК ПРОГРАММЫ

#====================================================================================#
#                                                                                    #
#                                ЗАГОЛОВОК ПРОГРАММЫ                                 #
#                                                                                    #
#====================================================================================#

#>>>  
#>>> text = 'Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы'
#>>> msg = important_message(text)
#>>> print(msg)
#====================================================================================#
#                                                                                    #
#     Обратите внимание на очень важное сообщение от команды разработчиков этой      #
#                               великолепной программы                               #
#                                                                                    #
#====================================================================================#
#>>>